# Make a Pandas DataFrame with two-dimensional list | Python

In [1]:
# A Pandas DataFrame is a 2 dimensional data structure, like a 2 dimensional array, or a table with rows and columns.
# DataFrame is like a table with rows and columns
import pandas as pd

In [2]:
lst = [['Geek', 25], ['is', 30], # here ['geeks',25] - will create 2 columns
       ['for', 26], ['Geeksforgeeks', 22]]

In [3]:
pd.DataFrame(lst)

               0   1
0           Geek  25
1             is  30
2            for  26
3  Geeksforgeeks  22

In [4]:
lst = [['sachin','kumar','myname',1,2]] # each name is a column here
pd.DataFrame(lst)

        0      1       2  3  4
0  sachin  kumar  myname  1  2

In [5]:
# we change the name of the columns
lst = [['geeks',20],['is',21],['for',26],['geeksforgeeks',22]]
pd.DataFrame(lst, columns=['a','b'])

               a   b
0          geeks  20
1             is  21
2            for  26
3  geeksforgeeks  22

In [6]:
lst = [['tom', 'reacher', 25], ['krish', 'pete', 30], 
       ['nick', 'wilson', 26], ['juli', 'williams', 22]] 
      
df = pd.DataFrame(lst, columns =['FName', 'LName', 'Age'],
                                           dtype = float) # here we chnange the data type of numerical data

In [7]:
df

   FName     LName   Age
0    tom   reacher  25.0
1  krish      pete  30.0
2   nick    wilson  26.0
3   juli  williams  22.0

In [9]:
lst = [['tom', 'reacher', 25], ['krish', 'pete', 30], 
       ['nick', 'wilson', 26], ['juli', 'williams', 22]] 
df = pd.DataFrame(lst, columns=['Fname','LName', 4], dtype = float) # i can give the column names of my choice
df

   Fname     LName     4
0    tom   reacher  25.0
1  krish      pete  30.0
2   nick    wilson  26.0
3   juli  williams  22.0